hey all, i created a zip map as local variable:
> local.myzip
{
  "10.75.113.223" = "subnet-hahahaha565"
  "10.75.113.247" = "subnet-hahahaha565"
  "10.75.117.238" = "subnet-hahahaha208"
  "10.75.117.46" = "subnet-hahahaha208"
  "10.75.121.200" = "subnet-hahahaha420f"
  "10.75.121.213" = "subnet-hahahaha420f"
}
when i use it in a resource block, plan and apply do not require any changes.
resource "aws_route53_resolver_endpoint" "inbound" {
  name      = var.vpc_name
  direction = "INBOUND"
  security_group_ids = [
    aws_security_group.route53-resolver.id
  ]
  dynamic "ip_address" {
    for_each = local.myzip
    content {
      ip        = ip_address.key
      subnet_id = ip_address.value
    }
  }
}
here is another strange data point, when i do a destroy of the resource, then apply, its only creating one ip from each subnet id - so three ips instead of six:
Terraform will perform the following actions:
  # aws_route53_resolver_endpoint.inbound will be created
  + resource "aws_route53_resolver_endpoint" "inbound" {
      + arn                = (known after apply)
      + direction          = "INBOUND"
      + host_vpc_id        = (known after apply)
      + id                 = (known after apply)
      + name               = "byname"
      + security_group_ids = [
          + "sg-<>",
        ]
      + ip_address {
          + ip        = "10.75.113.247"
          + ip_id     = (known after apply)
          + subnet_id = "subnet-hahahaha565"
        }
      + ip_address {
          + ip        = "10.75.117.46"
          + ip_id     = (known after apply)
          + subnet_id = "subnet-hahahaha208"
        }
      + ip_address {
          + ip        = "10.75.121.213"
          + ip_id     = (known after apply)
          + subnet_id = "subnet-hahahaha420f"
        }
    }
Plan: 1 to add, 0 to change, 0 to destroy.